from collections import OrderedDict

APP_STORE_LOCALE_NAMES = OrderedDict([
    ("ar-SA", "阿拉伯语"), ("bn-BD", "孟加拉语"), ("ca", "加泰罗尼亚语"),
    ("zh-Hans", "简体中文"), ("zh-Hant", "繁体中文"), ("hr", "克罗地亚语"),
    ("cs", "捷克语"), ("da", "丹麦语"), ("nl-NL", "荷兰语"),
    ("en-AU", "英语（澳大利亚）"), ("en-CA", "英语（加拿大）"),
    ("en-GB", "英语（英国）"), ("en-US", "英语（美国）"), ("fi", "芬兰语"),
    ("fr-FR", "法语"), ("fr-CA", "法语（加拿大）"), ("de-DE", "德语"),
    ("el", "希腊语"), ("gu-IN", "古吉拉特语"), ("he", "希伯来语"),
    ("hi", "北印度语"), ("hu", "匈牙利语"), ("id", "印度尼西亚语"),
    ("it", "意大利语"), ("ja", "日语"), ("kn-IN", "坎纳达语"),
    ("ko", "韩语"), ("ms", "马来语"), ("ml-IN", "马拉雅拉姆语"),
    ("mr-IN", "马拉地语"), ("no", "挪威语"), ("or-IN", "奥里亚语"),
    ("pl", "波兰语"), ("pt-BR", "葡萄牙语（巴西）"),
    ("pt-PT", "葡萄牙语（葡萄牙）"), ("pa-IN", "旁遮普语"),
    ("ro", "罗马尼亚语"), ("ru", "俄语"), ("sk", "斯洛伐克语"),
    ("sl-SI", "斯洛文尼亚语"), ("es-MX", "西班牙语（墨西哥）"),
    ("es-ES", "西班牙语（西班牙）"), ("sv", "瑞典语"),
    ("ta-IN", "泰米尔语"), ("te-IN", "泰卢固语"), ("th", "泰语"),
    ("tr", "土耳其语"), ("uk", "乌克兰语"), ("ur-PK", "乌尔都语"),
    ("vi", "越南语"),
])
